# Customer API - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-AhC6LYhkhvCzznvJ

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_user.random_password.password: Refreshing state... [id=none]
module.aws_lambda.data.archive_file.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-customer-api-staging-customer-api]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.aws_ssm_parameter.password: Refreshing state... [id=customer-api-staging-customer-api-password]
module.database_user.aws_ssm_parameter.username: Refreshing state... [id=customer-api-staging-customer-api-username]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=ibl9uk3da1]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230423113940606000000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=072ca24b8949667c991bcd7160e11abd968055b2]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=l2hfktq]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=pyrxf9t]
module.aws_api_gateway.aws_apigatewayv2_api.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_integration.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_route.any: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_stage.default: Drift detected (update)
module.aws_lambda.aws_iam_role.default: Drift detected (update)
module.aws_lambda.aws_lambda_function.default: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-customer-api-staging-customer-api"
      ~ last_modified                  = "2023-04-23T11:39:59.941+0000" -> (known after apply)
      ~ source_code_hash               = "BZXwJRdKzrdLUL+ctMV0G0ZCuecQRa0Q38EOd9QY5mo=" -> "9alH/NQ99Y27CWaRl+16qpPyrkVt2klAELU6hek1vVM="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.aws_ssm_parameter.password will be updated in-place
  ~ resource "aws_ssm_parameter" "password" {
        id             = "customer-api-staging-customer-api-password"
      + insecure_value = (known after apply)
        name           = "customer-api-staging-customer-api-password"
        tags           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "database_user"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-api"
        name       = "customer-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      + override_special = "!#$%&*()-_=+[]{}<>:?" # forces replacement
      ~ result           = (sensitive value)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*